HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxVadc_regdef.h
/** \\brief  Queue 0 Backup Register, Group */
typedef struct _Ifx_VADC_G_QBUR0_Bits
{
    unsigned int REQCHNR:5;                 /**< \brief [4:0] Request Channel Number (rh) */
    unsigned int RF:1;                      /**< \brief [5:5] Refill (rh) */
    unsigned int ENSI:1;                    /**< \brief [6:6] Enable Source Interrupt (rh) */
    unsigned int EXTR:1;                    /**< \brief [7:7] External Trigger (rh) */
    unsigned int V:1;                       /**< \brief [8:8] Request Channel Number Valid (rh) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_VADC_G_QBUR0_Bits;

/** \\brief  Queue 0 Source Control Register, Group */
typedef struct _Ifx_VADC_G_QCTRL0_Bits
{
    unsigned int SRCRESREG:4;               /**< \brief [3:0] Source-specific Result Register (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int XTSEL:4;                   /**< \brief [11:8] External Trigger Input Selection (rw) */
    unsigned int XTLVL:1;                   /**< \brief [12:12] External Trigger Level (rh) */
    unsigned int XTMODE:2;                  /**< \brief [14:13] Trigger Operating Mode (rw) */
    unsigned int XTWC:1;                    /**< \brief [15:15] Write Control for Trigger Configuration (w) */
    unsigned int GTSEL:4;                   /**< \brief [19:16] Gate Input Selection (rw) */
    unsigned int GTLVL:1;                   /**< \brief [20:20] Gate Input Level (rh) */
    unsigned int reserved_21:2;             /**< \brief \internal Reserved */
    unsigned int GTWC:1;                    /**< \brief [23:23] Write Control for Gate Configuration (w) */
    unsigned int reserved_24:4;             /**< \brief \internal Reserved */
    unsigned int TMEN:1;                    /**< \brief [28:28] Timer Mode Enable (rw) */
    unsigned int reserved_29:2;             /**< \brief \internal Reserved */
    unsigned int TMWC:1;                    /**< \brief [31:31] Write Control for Timer Mode (w) */
} Ifx_VADC_G_QCTRL0_Bits;

/** \\brief  Queue 0 Input Register, Group */
typedef struct _Ifx_VADC_G_QINR0_Bits
{
    unsigned int REQCHNR:5;                 /**< \brief [4:0] Request Channel Number (w) */
    unsigned int RF:1;                      /**< \brief [5:5] Refill (w) */
    unsigned int ENSI:1;                    /**< \brief [6:6] Enable Source Interrupt (w) */
    unsigned int EXTR:1;                    /**< \brief [7:7] External Trigger (w) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_VADC_G_QINR0_Bits;

/** \\brief  Queue 0 Mode Register, Group */
typedef struct _Ifx_VADC_G_QMR0_Bits
{
    unsigned int ENGT:2;                    /**< \brief [1:0] Enable Gate (rw) */
    unsigned int ENTR:1;                    /**< \brief [2:2] Enable External Trigger (rw) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int CLRV:1;                    /**< \brief [8:8] Clear Valid Bit (w) */
    unsigned int TREV:1;                    /**< \brief [9:9] Trigger Event (w) */
    unsigned int FLUSH:1;                   /**< \brief [10:10] Flush Queue (w) */
    unsigned int CEV:1;                     /**< \brief [11:11] Clear Event Flag (w) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int RPTDIS:1;                  /**< \brief [16:16] Repeat Disable (rw) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_VADC_G_QMR0_Bits;

/** \\brief  Queue 0 Status Register, Group */
typedef struct _Ifx_VADC_G_QSR0_Bits
{
    unsigned int FILL:4;                    /**< \brief [3:0] Filling Level for Queue (rh) */
    unsigned int reserved_4:1;              /**< \brief \internal Reserved */
    unsigned int EMPTY:1;                   /**< \brief [5:5] Queue Empty (rh) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int REQGT:1;                   /**< \brief [7:7] Request Gate Level (rh) */
    unsigned int EV:1;                      /**< \brief [8:8] Event Detected (rh) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_VADC_G_QSR0_Bits;

/** \\brief  Result Event Flag Clear Register, Group */
typedef struct _Ifx_VADC_G_REFCLR_Bits
{
    unsigned int REV0:1;                    /**< \brief [0:0] Clear Result Event for Result Register 0 (w) */
    unsigned int REV1:1;                    /**< \brief [1:1] Clear Result Event for Result Register 1 (w) */
    unsigned int REV2:1;                    /**< \brief [2:2] Clear Result Event for Result Register 2 (w) */
    unsigned int REV3:1;                    /**< \brief [3:3] Clear Result Event for Result Register 3 (w) */
    unsigned int REV4:1;                    /**< \brief [4:4] Clear Result Event for Result Register 4 (w) */
    unsigned int REV5:1;                    /**< \brief [5:5] Clear Result Event for Result Register 5 (w) */
    unsigned int REV6:1;                    /**< \brief [6:6] Clear Result Event for Result Register 6 (w) */
    unsigned int REV7:1;                    /**< \brief [7:7] Clear Result Event for Result Register 7 (w) */
    unsigned int REV8:1;                    /**< \brief [8:8] Clear Result Event for Result Register 8 (w) */
    unsigned int REV9:1;                    /**< \brief [9:9] Clear Result Event for Result Register 9 (w) */
    unsigned int REV10:1;                   /**< \brief [10:10] Clear Result Event for Result Register 10 (w) */
    unsigned int REV11:1;                   /**< \brief [11:11] Clear Result Event for Result Register 11 (w) */
    unsigned int REV12:1;                   /**< \brief [12:12] Clear Result Event for Result Register 12 (w) */
    unsigned int REV13:1;                   /**< \brief [13:13] Clear Result Event for Result Register 13 (w) */
    unsigned int REV14:1;                   /**< \brief [14:14] Clear Result Event for Result Register 14 (w) */
    unsigned int REV15:1;                   /**< \brief [15:15] Clear Result Event for Result Register 15 (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_VADC_G_REFCLR_Bits;

/** \\brief  Result Event Flag Register, Group */
typedef struct _Ifx_VADC_G_REFLAG_Bits
{
    unsigned int REV0:1;                    /**< \brief [0:0] Result Event for Result Register 0 (rwh) */
    unsigned int REV1:1;                    /**< \brief [1:1] Result Event for Result Register 1 (rwh) */
    unsigned int REV2:1;                    /**< \brief [2:2] Result Event for Result Register 2 (rwh) */
    unsigned int REV3:1;                    /**< \brief [3:3] Result Event for Result Register 3 (rwh) */
    unsigned int REV4:1;                    /**< \brief [4:4] Result Event for Result Register 4 (rwh) */
    unsigned int REV5:1;                    /**< \brief [5:5] Result Event for Result Register 5 (rwh) */
    unsigned int REV6:1;                    /**< \brief [6:6] Result Event for Result Register 6 (rwh) */
    unsigned int REV7:1;                    /**< \brief [7:7] Result Event for Result Register 7 (rwh) */
    unsigned int REV8:1;                    /**< \brief [8:8] Result Event for Result Register 8 (rwh) */
    unsigned int REV9:1;                    /**< \brief [9:9] Result Event for Result Register 9 (rwh) */
    unsigned int REV10:1;                   /**< \brief [10:10] Result Event for Result Register 10 (rwh) */
    unsigned int REV11:1;                   /**< \brief [11:11] Result Event for Result Register 11 (rwh) */
    unsigned int REV12:1;                   /**< \brief [12:12] Result Event for Result Register 12 (rwh) */
    unsigned int REV13:1;                   /**< \brief [13:13] Result Event for Result Register 13 (rwh) */
    unsigned int REV14:1;                   /**< \brief [14:14] Result Event for Result Register 14 (rwh) */
    unsigned int REV15:1;                   /**< \brief [15:15] Result Event for Result Register 15 (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_VADC_G_REFLAG_Bits;

/** \\brief  Result Event Node Pointer Register 0, Group */
typedef struct _Ifx_VADC_G_REVNP0_Bits
{
    unsigned int REV0NP:4;                  /**< \brief [3:0] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV1NP:4;                  /**< \brief [7:4] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV2NP:4;                  /**< \brief [11:8] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV3NP:4;                  /**< \brief [15:12] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV4NP:4;                  /**< \brief [19:16] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV5NP:4;                  /**< \brief [23:20] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV6NP:4;                  /**< \brief [27:24] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV7NP:4;                  /**< \brief [31:28] Service Request Node Pointer Result Event i (rw) */
} Ifx_VADC_G_REVNP0_Bits;

/** \\brief  Result Event Node Pointer Register 1, Group */
typedef struct _Ifx_VADC_G_REVNP1_Bits
{
    unsigned int REV8NP:4;                  /**< \brief [3:0] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV9NP:4;                  /**< \brief [7:4] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV10NP:4;                 /**< \brief [11:8] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV11NP:4;                 /**< \brief [15:12] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV12NP:4;                 /**< \brief [19:16] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV13NP:4;                 /**< \brief [23:20] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV14NP:4;                 /**< \brief [27:24] Service Request Node Pointer Result Event i (rw) */
    unsigned int REV15NP:4;                 /**< \brief [31:28] Service Request Node Pointer Result Event i (rw) */
} Ifx_VADC_G_REVNP1_Bits;

/** \\brief  Result Assignment Register, Group */
typedef struct _Ifx_VADC_G_RRASS_Bits
{
    unsigned int ASSRR0:1;                  /**< \brief [0:0] Assignment for Result Register 0 (rw) */
    unsigned int ASSRR1:1;                  /**< \brief [1:1] Assignment for Result Register 1 (rw) */
    unsigned int ASSRR2:1;                  /**< \brief [2:2] Assignment for Result Register 2 (rw) */
    unsigned int ASSRR3:1;                  /**< \brief [3:3] Assignment for Result Register 3 (rw) */
    unsigned int ASSRR4:1;                  /**< \brief [4:4] Assignment for Result Register 4 (rw) */
    unsigned int ASSRR5:1;                  /**< \brief [5:5] Assignment for Result Register 5 (rw) */
    unsigned int ASSRR6:1;                  /**< \brief [6:6] Assignment for Result Register 6 (rw) */
    unsigned int ASSRR7:1;                  /**< \brief [7:7] Assignment for Result Register 7 (rw) */
    unsigned int ASSRR8:1;                  /**< \brief [8:8] Assignment for Result Register 8 (rw) */
    unsigned int ASSRR9:1;                  /**< \brief [9:9] Assignment for Result Register 9 (rw) */
    unsigned int ASSRR10:1;                 /**< \brief [10:10] Assignment for Result Register 10 (rw) */
    unsigned int ASSRR11:1;                 /**< \brief [11:11] Assignment for Result Register 11 (rw) */
    unsigned int ASSRR12:1;                 /**< \brief [12:12] Assignment for Result Register 12 (rw) */
    unsigned int ASSRR13:1;                 /**< \brief [13:13] Assignment for Result Register 13 (rw) */
    unsigned int ASSRR14:1;                 /**< \brief [14:14] Assignment for Result Register 14 (rw) */
    unsigned int ASSRR15:1;                 /**< \brief [15:15] Assignment for Result Register 15 (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_VADC_G_RRASS_Bits;

