HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxVadc_regdef.h
/** \\brief  Group objects */
typedef volatile struct _Ifx_VADC_SHS
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_VADC_SHS_ID ID;                     /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[52];           /**< \brief C, \internal Reserved */
    Ifx_VADC_SHS_SHSCFG SHSCFG;             /**< \brief 40, SHS Configuration Register */
    Ifx_VADC_SHS_STEPCFG STEPCFG;           /**< \brief 44, Stepper Configuration Register */
    unsigned char reserved_48[56];          /**< \brief 48, \internal Reserved */
    Ifx_VADC_SHS_TIMCFG TIMCFG[4];          /**< \brief 80, Timing Configuration Register */
    unsigned char reserved_90[44];          /**< \brief 90, \internal Reserved */
    Ifx_VADC_SHS_CALCTR CALCTR;             /**< \brief BC, Calibration Control Register */
    Ifx_VADC_SHS_CALGC CALGC[4];            /**< \brief C0, Gain Calibration Control Register */
    unsigned char reserved_D0[304];         /**< \brief D0, \internal Reserved */
} Ifx_VADC_SHS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Vadc_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  VADC object */
typedef volatile struct _Ifx_VADC
{
    Ifx_VADC_CLC CLC;                       /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_VADC_ID ID;                         /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[28];           /**< \brief C, \internal Reserved */
    Ifx_VADC_OCS OCS;                       /**< \brief 28, OCDS Control and Status Register */
    Ifx_VADC_KRSTCLR KRSTCLR;               /**< \brief 2C, Kernel Reset Status Clear Register */
    Ifx_VADC_KRST1 KRST1;                   /**< \brief 30, Kernel Reset Register 1 */
    Ifx_VADC_KRST0 KRST0;                   /**< \brief 34, Kernel Reset Register 0 */
    unsigned char reserved_38[4];           /**< \brief 38, \internal Reserved */
    Ifx_VADC_ACCEN0 ACCEN0;                 /**< \brief 3C, Access Enable Register 0 */
    unsigned char reserved_40[64];          /**< \brief 40, \internal Reserved */
    Ifx_VADC_GLOBCFG GLOBCFG;               /**< \brief 80, Global Configuration Register */
    unsigned char reserved_84[4];           /**< \brief 84, \internal Reserved */
    Ifx_VADC_ACCPROT0 ACCPROT0;             /**< \brief 88, Access Protection Register */
    Ifx_VADC_ACCPROT1 ACCPROT1;             /**< \brief 8C, Access Protection Register */
    unsigned char reserved_90[16];          /**< \brief 90, \internal Reserved */
    Ifx_VADC_ICLASS GLOBICLASS[2];          /**< \brief A0, Input Class Register */
    unsigned char reserved_A8[16];          /**< \brief A8, \internal Reserved */
    Ifx_VADC_GLOBBOUND GLOBBOUND;           /**< \brief B8, Global Boundary Select Register */
    unsigned char reserved_BC[36];          /**< \brief BC, \internal Reserved */
    Ifx_VADC_GLOBEFLAG GLOBEFLAG;           /**< \brief E0, Global Event Flag Register */
    unsigned char reserved_E4[92];          /**< \brief E4, \internal Reserved */
    Ifx_VADC_GLOBEVNP GLOBEVNP;             /**< \brief 140, Global Event Node Pointer Register */
    unsigned char reserved_144[28];         /**< \brief 144, \internal Reserved */
    Ifx_VADC_GLOBTF GLOBTF;                 /**< \brief 160, Global Test Functions Register */
    unsigned char reserved_164[28];         /**< \brief 164, \internal Reserved */
    Ifx_VADC_BRSSEL BRSSEL[4];              /**< \brief 180, Background Request Source Channel Select Register, Group */
    unsigned char reserved_190[48];         /**< \brief 190, \internal Reserved */
    Ifx_VADC_BRSPND BRSPND[4];              /**< \brief 1C0, Background Request Source Pending Register, Group */
    unsigned char reserved_1D0[48];         /**< \brief 1D0, \internal Reserved */
    Ifx_VADC_BRSCTRL BRSCTRL;               /**< \brief 200, Background Request Source Control Register */
    Ifx_VADC_BRSMR BRSMR;                   /**< \brief 204, Background Request Source Mode Register */
    unsigned char reserved_208[120];        /**< \brief 208, \internal Reserved */
    Ifx_VADC_GLOBRCR GLOBRCR;               /**< \brief 280, Global Result Control Register */
    unsigned char reserved_284[124];        /**< \brief 284, \internal Reserved */
    Ifx_VADC_GLOBRES GLOBRES;               /**< \brief 300, Global Result Register */
    unsigned char reserved_304[124];        /**< \brief 304, \internal Reserved */
    Ifx_VADC_GLOBRESD GLOBRESD;             /**< \brief 380, Global Result Register, Debug */
    unsigned char reserved_384[108];        /**< \brief 384, \internal Reserved */
    Ifx_VADC_EMUXSEL EMUXSEL;               /**< \brief 3F0, External Multiplexer Select Register */
    unsigned char reserved_3F4[140];        /**< \brief 3F4, \internal Reserved */
    Ifx_VADC_G G[4];                        /**< \brief 480, Group objects */
    unsigned char reserved_1480[15232];     /**< \brief 1480, \internal Reserved */
    Ifx_VADC_SHS SHS[2];                    /**< \brief 5000, Group objects */
    unsigned char reserved_5400[3072];      /**< \brief 5400, \internal Reserved */
} Ifx_VADC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#if defined (__TASKING__)
#pragma warning restore
#endif
/******************************************************************************/
#endif /* IFXVADC_REGDEF_H */
